nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
    // Write data directly to UART FIFO
    // by design: don't bother checking the return value
    uart_write_bytes(palUart->UartNum, (const char *)palUart->TxRingBuffer.Reader(), palUart->TxOngoingCount);

    // pop elements from ring buffer, just pop
    palUart->TxRingBuffer.Pop(palUart->TxOngoingCount);

    // set event flag for COM OUT
    Events_Set(SYSTEM_EVENT_FLAG_COM_OUT);

    // delete task
    vTaskDelete(NULL);
}

// estimate the time required to perform the TX transaction
bool IsLongRunningOperation(uint32_t bufferSize, uint32_t baudRate, uint32_t &estimatedDurationMiliseconds)
{
    // simplifying calculation assuming worst case values for stop bits
    estimatedDurationMiliseconds = ((8 + 2) * bufferSize * 1000) / baudRate;

    if (estimatedDurationMiliseconds > CLR_RT_Thread::c_TimeQuantum_Milliseconds)
    {
        // total operation time will exceed thread quantum, so this is a long running operation
        return true;
    }
    else
    {
        return false;
    }
}

HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeDispose___VOID(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    uart_port_t uart_num;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);

    UnitializePalUart(GetPalUartFromUartNum(uart_num));

    NANOCLR_NOCLEANUP();
}

//
//  Initialise a new Serial port
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeInit___VOID(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    char task_name[16];
    uart_port_t uart_num;
    esp_err_t esp_err;

    NF_PAL_UART__ *palUart;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);
    if (uart_num > UART_NUM_MAX || uart_num < 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // unless the build is configure to use USB CDC, COM1 is being used for VS debug, so it's not available
#if !defined(CONFIG_USB_CDC_ENABLED)
    if (uart_num == 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }
#endif

    // call the configure and abort if not OK
    NANOCLR_CHECK_HRESULT(NativeConfig___VOID(stack));

    palUart = GetPalUartFromUartNum(uart_num);
    if (palUart == NULL)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // alloc buffers memory
    palUart->TxBuffer = (uint8_t *)platform_malloc(UART_BUFER_SIZE);
    palUart->RxBuffer = (uint8_t *)platform_malloc(UART_BUFER_SIZE);

    // sanity check
    if (palUart->TxBuffer == NULL || palUart->RxBuffer == NULL)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OUT_OF_MEMORY);
    }

    // init buffers
    palUart->TxRingBuffer.Initialize(palUart->TxBuffer, UART_BUFER_SIZE);
    palUart->RxRingBuffer.Initialize(palUart->RxBuffer, UART_BUFER_SIZE);

    // set/reset all the rest
    palUart->SerialDevice = stack.This();
    palUart->UartNum = uart_num;
    palUart->TxOngoingCount = 0;
    palUart->RxBytesToRead = 0;

    // Install driver
    esp_err = uart_driver_install(
        uart_num,
        // rx_buffer_size,
        UART_BUFER_SIZE,
        // tx_buffer_size, not buffered
        0,
        // queue_size
        20,
        // QueueHandle_t *uart_queue ( none for now )
        &(palUart->UartEventQueue),

        ESP_INTR_FLAG_IRAM);
    if (esp_err != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to install uart driver");
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    NANOCLR_CHECK_HRESULT(NativeConfig___VOID(stack));

    // Create a task to handle UART event from ISR
    snprintf(task_name, ARRAYSIZE(task_name), "uart%d_events", uart_num);
    if (xTaskCreatePinnedToCore(uart_event_task, task_name, 2048, palUart, 12, &(palUart->UartEventTask), 1) != pdPASS)
    {
        ESP_LOGE(TAG, "Failed to start UART events task");
        NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
    }

    // Ensure driver gets unitialized during soft reboot
    HAL_AddSoftRebootHandler(Esp32_Serial_UnitializeAll);

    NANOCLR_NOCLEANUP();
}

//
//  Set up serial port Configuration
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeConfig___VOID(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();
    {
        uart_config_t uart_config;

        // get a pointer to the managed object instance and check that it's not NULL
        CLR_RT_HeapBlock *pThis = stack.This();
        FAULT_ON_NULL(pThis);

        // Get Uart number for serial device
        uart_port_t uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);
        if (uart_num > UART_NUM_MAX || uart_num < 0)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // setup configuration
        // baud rate
        uart_config.baud_rate = (uint32_t)pThis[FIELD___baudRate].NumericByRef().s4;

        // data bits
        switch ((uint16_t)pThis[FIELD___dataBits].NumericByRef().s4)
        {
            case 5:
                uart_config.data_bits = UART_DATA_5_BITS;
                break;

            case 6:
                uart_config.data_bits = UART_DATA_6_BITS;
                break;

            case 7:
                uart_config.data_bits = UART_DATA_7_BITS;
                break;

            case 8:
                uart_config.data_bits = UART_DATA_8_BITS;
                break;

            default:
                NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // parity
        switch ((SerialParity)pThis[FIELD___parity].NumericByRef().s4)
        {
            default:
            case SerialParity_None:
                uart_config.parity = UART_PARITY_DISABLE;
                break;

            case SerialParity_Even:
                uart_config.parity = UART_PARITY_EVEN;
                break;

            case SerialParity_Odd:
                uart_config.parity = UART_PARITY_ODD;
                break;
        }

        // stop bits
        switch ((SerialStopBitCount)pThis[FIELD___stopBits].NumericByRef().s4)
        {
            default:
            case SerialStopBitCount_One:
                uart_config.stop_bits = UART_STOP_BITS_1;
                break;

            case SerialStopBitCount_OnePointFive:
                uart_config.stop_bits = UART_STOP_BITS_1_5;
                break;

            case SerialStopBitCount_Two:
                uart_config.stop_bits = UART_STOP_BITS_2;
                break;
        }

        uart_config.rx_flow_ctrl_thresh = 120;

        bool EnableXonXoff = false;
        switch ((SerialHandshake)pThis[FIELD___handshake].NumericByRef().s4)
        {
            default:
            case SerialHandshake_None:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
                break;

